# 03. Pandas 종합실습

작성자 : 한기영

1. 스스로 해결한 것
2. 설명을 듣고 완전히 이해한 것
3. 설명을 듣고 조금 이해한 것
4. 아직 이해 못하고 어렵게만 느껴지는 것  

...을 구분하여 스스로 체크하고,  
3번과 4번으로 체크한 문제는 반드시 강사에게 개인지도를 요청하세요~!!

### SQL Server에서 가져온 Sales, Customers, Products 를 이용하여 실습을 진행하세요.

In [7]:
# SQL Server 연결이 안 돼서 csv 파일로 진행함
import pandas as pd

df_products = pd.read_csv(r'C:\Users\50008313\Python_Jupyter_Study\2기교육\3_Python기초\샘플데이터\products.csv', engine = 'python',
                         sep = ',', skipinitialspace=True, encoding = 'utf-8')
df_sales = pd.read_csv(r'C:\Users\50008313\Python_Jupyter_Study\2기교육\3_Python기초\샘플데이터\sales.csv', engine = 'python',
                         sep = ',', skipinitialspace=True, encoding = 'utf-8')
df_customers = pd.read_csv(r'C:\Users\50008313\Python_Jupyter_Study\2기교육\3_Python기초\샘플데이터\customers.csv', engine = 'python',
                         sep = ',', skipinitialspace=True, encoding = 'utf-8')

df_products.head(10)
df_sales.head(10)
df_customers.head(10)

  CustomerID RegisterDate               Address Gender  BirthYear  Addr1 Addr2
0    c017487   2002-07-31  경기 성남시 중원구 둔촌대로190번길      F       1968    경기도   성남시
1    c017503   2002-07-31         서울 마포구 새터산12길      F       1971  서울특별시   마포구
2    c017517   2002-07-31      경기도 남양주시 와부읍 덕소로      M       1967    경기도  남양주시
3    c017522   2002-07-31           강원도 원주시 단구로      F       1965    강원도   원주시
4    c017526   2002-07-31  경기도 부천시 오정구 소사로730번길      F       1960    경기도   부천시
5    c017531   2002-07-31      인천광역시 서구 완정로64번길      F       1970  인천광역시    서구
6    c017538   2002-07-31           경기도 과천시 관문로      F       1964    경기도   과천시
7    c017544   2002-07-31      경기도 고양시 일산동구 고풍로      M       1965    경기도   고양시
8    c017546   2002-07-31       경기도 부천시 원미구 중동로      F       1966    경기도   부천시
9    c017551   2002-07-31          경기도 안성시 현수2길      F       1962    경기도   안성시

In [12]:
#1) Sales 에서 연도별 매출액을 조회하시오.
df_sales['OrderDate'] = df_sales['OrderDate'].astype('datetime64')
df_sales['year'] = df_sales['OrderDate'].dt.year

df_sales.groupby(by=['year'], as_index=False)['Amt'].sum()

   year        Amt
0  2016  152877017
1  2017   43111608

In [13]:
#2) 2016년 월별 매출액을 조회하시오.

   OrderID  Seq  OrderDate ProductID  Qty   Amt CustomerID  year
0        1    1 2016-01-02  p1030071    2  7900    c107853  2016
1        2    1 2016-01-02  p1012761    1  1700    c110521  2016
2        2    2 2016-01-02  p1012581    1  1000    c110521  2016
3        2    3 2016-01-02  p1175481    1  1300    c110521  2016
4        2    4 2016-01-02  p1178011    1  8800    c110521  2016

In [ ]:
#3) 2017년 고객별 매출액 상위 10명을 조회하시오.

In [ ]:
#4) 2017년에 가장 많이 팔린 상품 top 5를 판매량과 함께 조회하시오.

In [ ]:
#5) 2016년 Customers의 Addr1 별 매출액을 집계하시오.

In [ ]:
# 6) 3번 arr2 중에서 15보다 큰 값을 조회하세요.

In [ ]:
# 7) arr2의 전체 값에 제곱을 하여 arr3를 저장하시오.

In [ ]:
# 8) arr3 을 행 방향 합, 평균, 표준편차를 구하시오